handling null values

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r'D:\Notes\Excel works\marks_dataset_with_blanks.csv')
df

   StudentID        Name  Physics  Chemistry  Maths  Computer  Hindi  Kannada
0          1  Anil Kumar     85.0         78   92.0       NaN   80.0     88.0
1          2  Bharathi R     90.0         80   88.0      94.0   85.0     55.0
2          3   Chandan S     78.0         84    NaN      86.0    NaN     81.0
3          4     Divya P      NaN         79   84.0      88.0   82.0     85.0
4          5    Eshwar N     88.0         91   89.0      90.0   45.0     79.0
5          6     Farah K     76.0         85   95.0      80.0   88.0      NaN

In [3]:
df.isnull()

   StudentID   Name  Physics  Chemistry  Maths  Computer  Hindi  Kannada
0      False  False    False      False  False      True  False    False
1      False  False    False      False  False     False  False    False
2      False  False    False      False   True     False   True    False
3      False  False     True      False  False     False  False    False
4      False  False    False      False  False     False  False    False
5      False  False    False      False  False     False  False     True

In [4]:
df.isnull().sum()

StudentID    0
Name         0
Physics      1
Chemistry    0
Maths        1
Computer     1
Hindi        1
Kannada      1
dtype: int64

In [5]:
df.isnull().sum().sum()

np.int64(5)

In [6]:
df.shape

(6, 8)

In [7]:
df2 = df.dropna()           #dropping rows of null cells
df2

   StudentID        Name  Physics  Chemistry  Maths  Computer  Hindi  Kannada
1          2  Bharathi R     90.0         80   88.0      94.0   85.0     55.0
4          5    Eshwar N     88.0         91   89.0      90.0   45.0     79.0

In [8]:
df2.shape

(2, 8)

In [9]:
df3 = df.dropna(axis=1)
df3

   StudentID        Name  Chemistry
0          1  Anil Kumar         78
1          2  Bharathi R         80
2          3   Chandan S         84
3          4     Divya P         79
4          5    Eshwar N         91
5          6     Farah K         85

In [ ]:
df3.shape

In [ ]:
df.dropna(how='any')            #remove the rows that contains any null cells
df

In [ ]:
df.dropna(how='all')            #remove the rows that contains **all**null cells
df

In [10]:
df.dropna(inplace=True)        # replace the original dataframe
df

   StudentID        Name  Physics  Chemistry  Maths  Computer  Hindi  Kannada
1          2  Bharathi R     90.0         80   88.0      94.0   85.0     55.0
4          5    Eshwar N     88.0         91   89.0      90.0   45.0     79.0